acclmcopy-cfe-consolidation/DataProcessors/Consd_СверкаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>Consd_СверкаДанных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТаймаутЗапроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяOData</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольOData</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПравилаКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыСверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяOData</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СДвижениямиХозрасчетный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИсточник</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПриемник</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРасхождений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусСверки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьРасхождение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СводкаПоИсточникам</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсточникиСверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>URLСервераOData</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПользователяOData</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПарольOData</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:Type>cfg:ExchangePlanRef.Консолидация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

acclmcopy-cfe-consolidation/InformationRegisters/Consd_Источники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Consd_Источники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

acclmcopy-cfe-consolidation/DataProcessors/Consd_СверкаДанных/Ext/ObjectModule.bsl
#Область ПеременныеМодуля

// Кэш детализации сверки ОСВ по ключу строки табличной части "ОбъектыСверки".
// Заполняется при выполнении сверки, используется при формировании отчета.
Перем мДетализацияОСВ;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Проверяет доступность OData-сервисов всех источников, перечисленных в табличной
// части "ИсточникиСверки". Консолидация выполняется из нескольких баз-источников,
// поэтому проверяется каждое подключение по отдельности.
//
// Возвращаемое значение:
// Структура - результат проверки:
//   * Успешно - Булево - Истина, если подключение установлено ко всем источникам;
//   * ТекстОшибки - Строка - перечень источников с ошибками подключения (каждый с новой строки).
//
Функция ПроверитьПодключения() Экспорт

	Результат = Новый Структура("Успешно, ТекстОшибки", Истина, "");

	Если ИсточникиСверки.Количество() = 0 Тогда
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = НСтр("ru = 'Не заполнен список источников сверки.'");
		Возврат Результат;
	КонецЕсли;

	ТекстыОшибок = Новый Массив;

	Для Каждого СтрокаИсточника Из ИсточникиСверки Цикл
		РезультатИсточника = ПроверитьПодключениеКИсточнику(СтрокаИсточника);
		Если НЕ РезультатИсточника.Успешно Тогда
			Результат.Успешно = Ложь;
			ТекстыОшибок.Добавить(СтрШаблон("%1: %2", СтрокаИсточника.URLСервераOData, РезультатИсточника.ТекстОшибки));
		КонецЕсли;
	КонецЦикла;

	Результат.ТекстОшибки = СтрСоединить(ТекстыОшибок, Символы.ПС);

	Возврат Результат;

КонецФункции

// Проверяет наличие коллекции "AccountingRegister_Хозрасчетный" в стандартном
// интерфейсе OData каждого источника из табличной части "ИсточникиСверки".
// Начиная с версии платформы 8.3.5.1068 объекты должны быть явно включены в состав
// стандартного интерфейса OData, поэтому отсутствие коллекции чаще всего означает,
// что регистр не опубликован на соответствующем источнике.
//
// Возвращаемое значение:
// Структура - результат проверки:
//   * Существует - Булево - Истина, если коллекция доступна на всех источниках;
//   * ТекстОшибки - Строка - перечень источников с ошибками (каждый с новой строки).
//
Функция ПроверитьНаличиеРегистраХозрасчетный() Экспорт

	Результат = Новый Структура("Существует, ТекстОшибки", Истина, "");

	Если ИсточникиСверки.Количество() = 0 Тогда
		Результат.Существует = Ложь;
		Результат.ТекстОшибки = НСтр("ru = 'Не заполнен список источников сверки.'");
		Возврат Результат;
	КонецЕсли;

	ТекстыОшибок = Новый Массив;

	Для Каждого СтрокаИсточника Из ИсточникиСверки Цикл
		РезультатИсточника = ПроверитьНаличиеКоллекцииOData("AccountingRegister_Хозрасчетный", СтрокаИсточника);
		Если НЕ РезультатИсточника.Существует Тогда
			Результат.Существует = Ложь;
			ТекстыОшибок.Добавить(СтрШаблон("%1: %2", СтрокаИсточника.URLСервераOData, РезультатИсточника.ТекстОшибки));
		КонецЕсли;
	КонецЦикла;

	Результат.ТекстОшибки = СтрСоединить(ТекстыОшибок, Символы.ПС);

	Возврат Результат;

КонецФункции

// Заполняет табличную часть "ИсточникиСверки" данными из регистра сведений
// "Consd_Источники". Каждая запись регистра описывает базу-источник консолидации:
// адрес OData-сервиса, пользователя, пароль и организацию приемника. Ранее введенные
// строки табличной части замещаются данными регистра.
//
Процедура ЗаполнитьИсточникиИзРегистра() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Источники.Организация КАК Организация,
	|	Источники.Адрес КАК Адрес
	|ИЗ
	|	РегистрСведений.Consd_Источники КАК Источники";

	Выборка = Запрос.Выполнить().Выбрать();

	ИсточникиСверки.Очистить();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ИсточникиСверки.Добавить();
		НоваяСтрока.URLСервераOData = Выборка.Адрес;
		НоваяСтрока.Организация = Выборка.Организация;
	КонецЦикла;

КонецПроцедуры

// Заполняет табличную часть "ОбъектыСверки" перечнем объектов для сверки: регистром
// бухгалтерии "Хозрасчетный", его документами-регистраторами и справочниками, которые
// используются в качестве видов субконто этого регистра. Именно эти объекты значимы
// для консолидации данных бухгалтерского учета, прочие справочники и документы
// конфигурации в список не включаются. Ранее выбранные пользователем строки (по имени
// объекта) сохраняются.
//
Процедура ЗаполнитьСписокОбъектов() Экспорт

	ВыбранныеРанее = Новый Соответствие;
	Для Каждого СтарСтрока Из ОбъектыСверки Цикл
		Если СтарСтрока.Выбран Тогда
			ВыбранныеРанее.Вставить(СтарСтрока.ИмяOData, Истина);
		КонецЕсли;
	КонецЦикла;

	ОбъектыСверки.Очистить();

	СтатусСверкиНеВыполнена = НСтр("ru = 'Не выполнена'");
	РегистрМетаданные = Метаданные.РегистрыБухгалтерии.Хозрасчетный;

	НоваяСтрока = ОбъектыСверки.Добавить();
	НоваяСтрока.ТипОбъекта = "РегистрБухгалтерии";
	НоваяСтрока.ИмяОбъекта = НСтр("ru = 'Хозрасчетный (итоги ОСВ)'");
	НоваяСтрока.ИмяOData = "AccountingRegister_Хозрасчетный";
	НоваяСтрока.СДвижениямиХозрасчетный = Истина;
	НоваяСтрока.СтатусСверки = СтатусСверкиНеВыполнена;
	НоваяСтрока.Выбран = Истина;

	// Регистраторы регистра "Хозрасчетный" - документы, которые могут формировать
	// движения по этому регистру. Только они значимы для сверки консолидации.
	Для Каждого ОписаниеДокумента Из ПолучитьДокументыРегистраторыРегистра(РегистрМетаданные) Цикл
		НоваяСтрока = ОбъектыСверки.Добавить();
		НоваяСтрока.ТипОбъекта = "Документ";
		НоваяСтрока.ИмяОбъекта = ОписаниеДокумента.Синоним;
		НоваяСтрока.ИмяOData = "Document_" + ОписаниеДокумента.Имя;
		НоваяСтрока.СтатусСверки = СтатусСверкиНеВыполнена;
		НоваяСтрока.Выбран = (ВыбранныеРанее.Получить(НоваяСтрока.ИмяOData) <> Неопределено);
	КонецЦикла;

	// Справочники, используемые в качестве видов субконто регистра "Хозрасчетный"
	// (определяются через план счетов регистра и его план видов характеристик).
	Для Каждого ОписаниеСправочника Из ПолучитьСправочникиСубконтоРегистра(РегистрМетаданные) Цикл
		НоваяСтрока = ОбъектыСверки.Добавить();
		НоваяСтрока.ТипОбъекта = "Справочник";
		НоваяСтрока.ИмяОбъекта = ОписаниеСправочника.Синоним;
		НоваяСтрока.ИмяOData = "Catalog_" + ОписаниеСправочника.Имя;
		НоваяСтрока.СтатусСверки = СтатусСверкиНеВыполнена;
		НоваяСтрока.Выбран = (ВыбранныеРанее.Получить(НоваяСтрока.ИмяOData) <> Неопределено);
	КонецЦикла;

КонецПроцедуры

// Выполняет сверку данных по всем отмеченным строкам табличной части "ОбъектыСверки".
// Данные собираются со всех источников, перечисленных в "ИсточникиСверки", и сравниваются
// с данными приемника. Для регистра "Хозрасчетный" сравниваются итоги ОСВ по шести
// показателям, для справочников и документов - состав объектов по UUID.
//
Процедура ВыполнитьСверку() Экспорт

	Если ИсточникиСверки.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнен список источников сверки.'");
	КонецЕсли;

	ИнициализироватьДетализациюОСВ();

	Для Каждого СтрокаОбъекта Из ОбъектыСверки Цикл

		Если НЕ СтрокаОбъекта.Выбран Тогда
			Продолжить;
		КонецЕсли;

		СтрокаОбъекта.ТекстОшибки = "";

		Попытка
			Если СтрокаОбъекта.ТипОбъекта = "РегистрБухгалтерии" Тогда
				ВыполнитьСверкуРегистраХозрасчетный(СтрокаОбъекта);
			Иначе
				ВыполнитьСверкуСсылочногоОбъекта(СтрокаОбъекта);
			КонецЕсли;
		Исключение
			СтрокаОбъекта.СтатусСверки = НСтр("ru = 'Ошибка'");
			СтрокаОбъекта.ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Сверка данных OData'"),
				УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

// Формирует табличный документ с результатами последней выполненной сверки.
//
// Возвращаемое значение:
// ТабличныйДокумент - готовый к показу отчет сверки.
//
Функция СформироватьОтчет() Экспорт

	Макет = ПолучитьМакет("ОтчетСверки");
	ТабДок = Новый ТабличныйДокумент;

	ОбластьЗаголовка = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовка.Параметры.ТекстЗаголовка = СтрШаблон(НСтр("ru = 'Отчет сверки данных: %1'"), ТипСверки);
	ОбластьЗаголовка.Параметры.ТекстПериода = СтрШаблон(
		НСтр("ru = 'Период: %1 - %2. Источников: %3. Сформирован: %4'"),
		Формат(ДатаНачала, "ДЛФ=D"), Формат(ДатаОкончания, "ДЛФ=D"),
		Формат(ИсточникиСверки.Количество(), "ЧГ=0"), Формат(ТекущаяДатаСеанса(), "ДЛФ=DT"));
	ТабДок.Вывести(ОбластьЗаголовка);

	ТабДок.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));

	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	ОбластьОшибки = Макет.ПолучитьОбласть("СтрокаОшибка");

	ИтогоИсточник = 0;
	ИтогоПриемник = 0;
	ИтогоРасхождений = 0;
	НомерСтроки = 0;

	Для Каждого СтрокаОбъекта Из ОбъектыСверки Цикл

		Если НЕ СтрокаОбъекта.Выбран Тогда
			Продолжить;
		КонецЕсли;

		НомерСтроки = НомерСтроки + 1;

		ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтроки.Параметры.ИмяОбъекта = СтрокаОбъекта.ИмяОбъекта;
		ОбластьСтроки.Параметры.КоличествоИсточник = СтрокаОбъекта.КоличествоИсточник;
		ОбластьСтроки.Параметры.КоличествоПриемник = СтрокаОбъекта.КоличествоПриемник;
		ОбластьСтроки.Параметры.КоличествоРасхождений = СтрокаОбъекта.КоличествоРасхождений;
		ОбластьСтроки.Параметры.СтатусСверки = СтрокаОбъекта.СтатусСверки;
		ТабДок.Вывести(ОбластьСтроки);

		Если СтрокаОбъекта.СДвижениямиХозрасчетный Тогда
			ВывестиДетализациюОСВВОтчет(ТабДок, Макет, СтрокаОбъекта);
		ИначеЕсли ЗначениеЗаполнено(СтрокаОбъекта.ТекстОшибки) Тогда
			ОбластьОшибки.Параметры.ТекстОшибки = СтрокаОбъекта.ТекстОшибки;
			ТабДок.Вывести(ОбластьОшибки);
		КонецЕсли;

		ИтогоИсточник = ИтогоИсточник + СтрокаОбъекта.КоличествоИсточник;
		ИтогоПриемник = ИтогоПриемник + СтрокаОбъекта.КоличествоПриемник;
		ИтогоРасхождений = ИтогоРасхождений + СтрокаОбъекта.КоличествоРасхождений;

	КонецЦикла;

	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.ИтогоИсточник = ИтогоИсточник;
	ОбластьИтого.Параметры.ИтогоПриемник = ИтогоПриемник;
	ОбластьИтого.Параметры.ИтогоРасхождений = ИтогоРасхождений;
	ОбластьИтого.Параметры.ИтогоСтатус = ?(ИтогоРасхождений = 0,
		НСтр("ru = 'Совпадает'"), НСтр("ru = 'Есть расхождения'"));
	ТабДок.Вывести(ОбластьИтого);

	УстановитьШиринуКолонокОтчета(ТабДок);
	ТабДок.АвтоМасштаб = Ложь;

	Возврат ТабДок;

КонецФункции

// Формирует таблицу сравнения ОСВ регистра "Хозрасчетный" в разрезе счетов и источников.
// Слева - данные источника (OData), справа - данные приемника (эта база) по той же организации.
// Счета сопоставляются по коду. По каждой строке источников сверки формируется свой набор строк.
//
// Возвращаемое значение:
// ТаблицаЗначений - строки в разрезе источника и счета. Колонки:
//   * КодСчета - Строка - код счета (ключ сопоставления);
//   * Счет - Строка - представление счета (код и наименование);
//   * Источник - Строка - представление источника (организация / адрес OData);
//   * Ист* - Число - показатели ОСВ источника;
//   * Пр*  - Число - показатели ОСВ приемника по той же организации.
//
Функция ПолучитьОСВСравнениеПоСчетам() Экспорт

	ТаблицаОСВ = СоздатьТаблицуОСВСравнения();
	СтрокиПоКлючу = Новый Соответствие;

	Для Каждого СтрокаИсточника Из ИсточникиСверки Цикл

		ПредставлениеИсточника = ПредставлениеИсточникаОСВ(СтрокаИсточника);

		ОСВПриемника = ПолучитьОСВПоСчетамПриемник(СтрокаИсточника.Организация);
		Для Каждого ЭлементСчета Из ОСВПриемника Цикл
			СтрокаТаблицы = ПолучитьСтрокуОСВ(ТаблицаОСВ, СтрокиПоКлючу,
				ЭлементСчета.Ключ, ЭлементСчета.Значение.Наименование, ПредставлениеИсточника);
			НакопитьСуммыОСВ(СтрокаТаблицы, ЭлементСчета.Значение, "Пр");
		КонецЦикла;

		ОСВИсточника = ПолучитьОСВПоСчетамИсточник(СтрокаИсточника);
		Для Каждого ЭлементСчета Из ОСВИсточника Цикл
			СтрокаТаблицы = ПолучитьСтрокуОСВ(ТаблицаОСВ, СтрокиПоКлючу,
				ЭлементСчета.Ключ, ЭлементСчета.Значение.Наименование, ПредставлениеИсточника);
			НакопитьСуммыОСВ(СтрокаТаблицы, ЭлементСчета.Значение, "Ист");
		КонецЦикла;

	КонецЦикла;

	ТаблицаОСВ.Сортировать("Источник, КодСчета");

	Возврат ТаблицаОСВ;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает пустую таблицу значений для сравнения ОСВ по счетам.
// Структура колонок должна совпадать с реквизитом формы "ОСВ" (используется Загрузить).
//
Функция СоздатьТаблицуОСВСравнения()

	КвалификаторыКода = Новый КвалификаторыСтроки(20);
	КвалификаторыНаименования = Новый КвалификаторыСтроки(150);
	КвалификаторыИсточника = Новый КвалификаторыСтроки(150);
	КвалификаторыСуммы = Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой);

	ТипКода = Новый ОписаниеТипов("Строка", , КвалификаторыКода);
	ТипНаименования = Новый ОписаниеТипов("Строка", , КвалификаторыНаименования);
	ТипИсточника = Новый ОписаниеТипов("Строка", , КвалификаторыИсточника);
	ТипСуммы = Новый ОписаниеТипов("Число", КвалификаторыСуммы);

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("КодСчета", ТипКода);
	Таблица.Колонки.Добавить("Счет", ТипНаименования);
	Таблица.Колонки.Добавить("Источник", ТипИсточника);

	Для Каждого Префикс Из СтрРазделить("Ист,Пр", ",", Ложь) Цикл
		Таблица.Колонки.Добавить(Префикс + "СальдоНачалоДт", ТипСуммы);
		Таблица.Колонки.Добавить(Префикс + "СальдоНачалоКт", ТипСуммы);
		Таблица.Колонки.Добавить(Префикс + "ОборотДт", ТипСуммы);
		Таблица.Колонки.Добавить(Префикс + "ОборотКт", ТипСуммы);
		Таблица.Колонки.Добавить(Префикс + "СальдоКонецДт", ТипСуммы);
		Таблица.Колонки.Добавить(Префикс + "СальдоКонецКт", ТипСуммы);
	КонецЦикла;

	Возврат Таблица;

КонецФункции

// Возвращает строку таблицы ОСВ для указанного источника и кода счета.
//
Функция ПолучитьСтрокуОСВ(ТаблицаОСВ, СтрокиПоКлючу, КодСчета, Наименование, ПредставлениеИсточника)

	КлючСчета = СокрЛП(КодСчета);
	КлючСтроки = ПредставлениеИсточника + "|" + КлючСчета;
	СтрокаТаблицы = СтрокиПоКлючу.Получить(КлючСтроки);

	Если СтрокаТаблицы = Неопределено Тогда
		СтрокаТаблицы = ТаблицаОСВ.Добавить();
		СтрокаТаблицы.КодСчета = КлючСчета;
		СтрокаТаблицы.Счет = ПредставлениеСчетаОСВ(КлючСчета, Наименование);
		СтрокаТаблицы.Источник = ПредставлениеИсточника;
		СтрокиПоКлючу.Вставить(КлючСтроки, СтрокаТаблицы);
	ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТаблицы.Счет) И ЗначениеЗаполнено(Наименование) Тогда
		СтрокаТаблицы.Счет = ПредставлениеСчетаОСВ(КлючСчета, Наименование);
	КонецЕсли;

	Возврат СтрокаТаблицы;

КонецФункции

// Возвращает представление источника для таблицы ОСВ.
//
Функция ПредставлениеИсточникаОСВ(СтрокаИсточника)

	Если ЗначениеЗаполнено(СтрокаИсточника.Организация) Тогда
		Возврат Строка(СтрокаИсточника.Организация);
	КонецЕсли;

	Если ЗначениеЗаполнено(СтрокаИсточника.URLСервераOData) Тогда
		Возврат СтрокаИсточника.URLСервераOData;
	КонецЕсли;

	Возврат НСтр("ru = 'Источник без организации'");

КонецФункции

// Возвращает представление счета для таблицы ОСВ: код и наименование.
//
Функция ПредставлениеСчетаОСВ(КодСчета, Наименование)

	Если ЗначениеЗаполнено(Наименование) Тогда
		Возврат СокрЛП(КодСчета) + " " + СокрЛП(Наименование);
	КонецЕсли;

	Возврат СокрЛП(КодСчета);

КонецФункции

// Прибавляет показатели ОСВ к строке таблицы сравнения по указанной стороне.
//
// Параметры:
// СтрокаТаблицы - СтрокаТаблицыЗначений - строка таблицы сравнения ОСВ;
// Итоги         - Структура - показатели ОСВ (сальдо на начало, обороты, сальдо на конец);
// Префикс       - Строка - "Ист" (источник) или "Пр" (приемник).
//
Процедура НакопитьСуммыОСВ(СтрокаТаблицы, Итоги, Префикс)

	СтрокаТаблицы[Префикс + "СальдоНачалоДт"] = СтрокаТаблицы[Префикс + "СальдоНачалоДт"] + Итоги.СальдоНачалоДт;
	СтрокаТаблицы[Префикс + "СальдоНачалоКт"] = СтрокаТаблицы[Префикс + "СальдоНачалоКт"] + Итоги.СальдоНачалоКт;
	СтрокаТаблицы[Префикс + "ОборотДт"] = СтрокаТаблицы[Префикс + "ОборотДт"] + Итоги.ОборотДт;
	СтрокаТаблицы[Префикс + "ОборотКт"] = СтрокаТаблицы[Префикс + "ОборотКт"] + Итоги.ОборотКт;
	СтрокаТаблицы[Префикс + "СальдоКонецДт"] = СтрокаТаблицы[Префикс + "СальдоКонецДт"] + Итоги.СальдоКонецДт;
	СтрокаТаблицы[Префикс + "СальдоКонецКт"] = СтрокаТаблицы[Префикс + "СальдоКонецКт"] + Итоги.СальдоКонецКт;

КонецПроцедуры

// Возвращает показатели ОСВ приемника (эта база) в разрезе счетов.
// При заполненной организации применяется отбор по ней; иначе - без отбора.
//
// Параметры:
// Организация - СправочникСсылка.Организации, Неопределено - организация приемника.
//
// Возвращаемое значение:
// Соответствие - ключ: код счета (Строка); значение: Структура итогов ОСВ с полем "Наименование".
//
Функция ПолучитьОСВПоСчетамПриемник(Организация = Неопределено)

	ТекстОтбораПоОрганизации = "";
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстОтбораПоОрганизации = "
		|	И ОстаткиИОбороты.Организация = &Организация";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиИОбороты.Счет.Код КАК КодСчета,
	|	ОстаткиИОбороты.Счет.Наименование КАК НаименованиеСчета,
	|	ЕСТЬNULL(СУММА(ОстаткиИОбороты.СуммаНачальныйОстатокДт), 0) КАК СальдоНачалоДт,
	|	ЕСТЬNULL(СУММА(ОстаткиИОбороты.СуммаНачальныйОстатокКт), 0) КАК СальдоНачалоКт,
	|	ЕСТЬNULL(СУММА(ОстаткиИОбороты.СуммаОборотДт), 0) КАК ОборотДт,
	|	ЕСТЬNULL(СУММА(ОстаткиИОбороты.СуммаОборотКт), 0) КАК ОборотКт,
	|	ЕСТЬNULL(СУММА(ОстаткиИОбороты.СуммаКонечныйОстатокДт), 0) КАК СальдоКонецДт,
	|	ЕСТЬNULL(СУММА(ОстаткиИОбороты.СуммаКонечныйОстатокКт), 0) КАК СальдоКонецКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, , , ) КАК ОстаткиИОбороты
	|ГДЕ
	|	ИСТИНА"
	+ ТекстОтбораПоОрганизации + "
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиИОбороты.Счет.Код,
	|	ОстаткиИОбороты.Счет.Наименование";

	Запрос.УстановитьПараметр("ДатаНачала", ?(ЗначениеЗаполнено(ДатаНачала), ДатаНачала, Дата(1, 1, 1)));
	Запрос.УстановитьПараметр("ДатаОкончания", ?(ЗначениеЗаполнено(ДатаОкончания), КонецДня(ДатаОкончания), Дата(9999, 12, 31)));
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;

	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Итоги = НовыеИтогиОСВ();
		ЗаполнитьИтогиОСВИзВыборки(Итоги, Выборка);
		Итоги.Вставить("Наименование", Выборка.НаименованиеСчета);
		Результат.Вставить(СокрЛП(Выборка.КодСчета), Итоги);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает показатели ОСВ одного источника (OData) в разрезе счетов. Счета
// сопоставляются по коду через карту счетов источника (Ref_Key -> код).
//
// Параметры:
// СтрокаИсточника - СтрокаТаблицыЗначений - строка табличной части "ИсточникиСверки".
//
// Возвращаемое значение:
// Соответствие - ключ: код счета (Строка); значение: Структура итогов ОСВ с полем "Наименование".
//
Функция ПолучитьОСВПоСчетамИсточник(СтрокаИсточника)

	Результат = Новый Соответствие;
	КартаСчетов = ПолучитьКартуСчетовOData(СтрокаИсточника);

	ЧастиURL = РазложитьURL(СтрокаИсточника.URLСервераOData);
	Соединение = СоздатьHTTPСоединение(ЧастиURL, СтрокаИсточника.ИмяПользователяOData, СтрокаИсточника.ПарольOData);

	ПараметрыФункции = СформироватьПараметрыПериодаOData(ДатаНачала, ДатаОкончания);
	ДобавитьУсловиеОрганизацииOData(ПараметрыФункции, СтрокаИсточника.Организация);

	ИменаПолейСчет = ИменаПолейСчетKeyOData();
	РазмерСтраницы = 1000;
	ОтносительныйПуть = ЧастиURL.ПутьРесурса + "/AccountingRegister_Хозрасчетный/BalanceAndTurnovers("
		+ СтрСоединить(ПараметрыФункции, ",") + ")"
		+ "?$format=json&$top=" + Формат(РазмерСтраницы, "ЧГ=0");

	Пока ЗначениеЗаполнено(ОтносительныйПуть) Цикл

		HTTPЗапрос = Новый HTTPЗапрос(ОтносительныйПуть);
		HTTPЗапрос.Заголовки.Вставить("Accept", "application/json");

		Ответ = Соединение.Получить(HTTPЗапрос);

		Если Ответ.КодСостояния <> КодСостоянияHTTPУспешно() Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Ошибка получения ОСВ по счетам источника %1: код ответа %2.'"),
				СтрокаИсточника.URLСервераOData, Формат(Ответ.КодСостояния, "ЧГ=0"));
		КонецЕсли;

		ТелоОтвета = РазобратьJSON(Ответ.ПолучитьТелоКакСтроку());
		СписокЭлементов = ТелоОтвета.Получить("value");

		Если СписокЭлементов <> Неопределено Тогда
			Для Каждого Элемент Из СписокЭлементов Цикл

				GUIDСчета = НормализоватьGUIDOData(ПолучитьСтрокуПоляOData(Элемент, ИменаПолейСчет));
				Если НЕ ЗначениеЗаполнено(GUIDСчета) Тогда
					Продолжить;
				КонецЕсли;

				ОписаниеСчета = КартаСчетов.Получить(GUIDСчета);
				Если ОписаниеСчета = Неопределено Тогда
					Продолжить;
				КонецЕсли;

				Итоги = Результат.Получить(ОписаниеСчета.Код);
				Если Итоги = Неопределено Тогда
					Итоги = НовыеИтогиОСВ();
					Итоги.Вставить("Наименование", ОписаниеСчета.Наименование);
					Результат.Вставить(ОписаниеСчета.Код, Итоги);
				КонецЕсли;

				ДобавитьИтогиОСВИзOData(Итоги, Элемент);

			КонецЦикла;
		КонецЕсли;

		СледующаяСсылка = ТелоОтвета.Получить("odata.nextLink");
		Если ЗначениеЗаполнено(СледующаяСсылка) Тогда
			ОтносительныйПуть = ПолучитьОтносительныйПутьИзСсылки(СледующаяСсылка);
		Иначе
			ОтносительныйПуть = "";
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает карту счетов источника: соответствие уникального идентификатора счета
// (Ref_Key в нижнем регистре) описанию счета (код и наименование). Список счетов
// считывается постранично из коллекции OData "ChartOfAccounts_Хозрасчетный".
//
// Параметры:
// СтрокаИсточника - СтрокаТаблицыЗначений - строка табличной части "ИсточникиСверки".
//
Функция ПолучитьКартуСчетовOData(СтрокаИсточника)

	Результат = Новый Соответствие;

	ЧастиURL = РазложитьURL(СтрокаИсточника.URLСервераOData);
	Соединение = СоздатьHTTPСоединение(ЧастиURL, СтрокаИсточника.ИмяПользователяOData, СтрокаИсточника.ПарольOData);

	РазмерСтраницы = 1000;
	ОтносительныйПуть = ЧастиURL.ПутьРесурса
		+ "/ChartOfAccounts_Хозрасчетный?$select=Ref_Key,Code,Description&$format=json&$top="
		+ Формат(РазмерСтраницы, "ЧГ=0");

	Пока ЗначениеЗаполнено(ОтносительныйПуть) Цикл

		HTTPЗапрос = Новый HTTPЗапрос(ОтносительныйПуть);
		HTTPЗапрос.Заголовки.Вставить("Accept", "application/json");

		Ответ = Соединение.Получить(HTTPЗапрос);

		Если Ответ.КодСостояния <> КодСостоянияHTTPУспешно() Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Ошибка получения плана счетов источника %1: код ответа %2.'"),
				СтрокаИсточника.URLСервераOData, Формат(Ответ.КодСостояния, "ЧГ=0"));
		КонецЕсли;

		ТелоОтвета = РазобратьJSON(Ответ.ПолучитьТелоКакСтроку());
		СписокЭлементов = ТелоОтвета.Получить("value");

		Если СписокЭлементов <> Неопределено Тогда
			Для Каждого Элемент Из СписокЭлементов Цикл
				RefKey = НормализоватьGUIDOData(Элемент.Получить("Ref_Key"));
				Если НЕ ЗначениеЗаполнено(RefKey) Тогда
					Продолжить;
				КонецЕсли;
				ОписаниеСчета = Новый Структура("Код, Наименование");
				ОписаниеСчета.Код = СокрЛП(Строка(Элемент.Получить("Code")));
				ОписаниеСчета.Наименование = Строка(Элемент.Получить("Description"));
				Результат.Вставить(RefKey, ОписаниеСчета);
			КонецЦикла;
		КонецЕсли;

		СледующаяСсылка = ТелоОтвета.Получить("odata.nextLink");
		Если ЗначениеЗаполнено(СледующаяСсылка) Тогда
			ОтносительныйПуть = ПолучитьОтносительныйПутьИзСсылки(СледующаяСсылка);
		Иначе
			ОтносительныйПуть = "";
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает строковое значение поля OData, перебирая допустимые имена свойства.
//
Функция ПолучитьСтрокуПоляOData(ЭлементOData, ИменаПолей)

	Для Каждого ИмяПоля Из ИменаПолей Цикл
		ЗначениеПоля = ЭлементOData.Получить(ИмяПоля);
		Если ЗначениеПоля <> Неопределено Тогда
			Возврат Строка(ЗначениеПоля);
		КонецЕсли;
	КонецЦикла;

	Возврат "";

КонецФункции

// Возвращает допустимые имена поля ссылки на счет в ответе OData виртуальной таблицы
// BalanceAndTurnovers регистра бухгалтерии.
//
Функция ИменаПолейСчетKeyOData()

	Имена = Новый Массив;
	Имена.Добавить("Account_Key");
	Имена.Добавить("Счет_Key");
	Имена.Добавить("AccountKey");
	Имена.Добавить("СчетKey");
	Возврат Имена;

КонецФункции

// Приводит GUID из ответа OData к единому виду для сопоставления
// (нижний регистр, без фигурных скобок).
//
Функция НормализоватьGUIDOData(Значение)

	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат "";
	КонецЕсли;

	Результат = НРег(СокрЛП(Строка(Значение)));
	Результат = СтрЗаменить(Результат, "{", "");
	Результат = СтрЗаменить(Результат, "}", "");

	Возврат Результат;

КонецФункции

// Устанавливает ширину колонок сформированного табличного документа отчета.
//
// Параметры:
// ТабДок - ТабличныйДокумент - сформированный отчет сверки.
//
Процедура УстановитьШиринуКолонокОтчета(ТабДок)

	ШириныКолонок = Новый Массив;
	ШириныКолонок.Добавить(6);  // №
	ШириныКолонок.Добавить(55); // Объект сверки
	ШириныКолонок.Добавить(12); // Источник
	ШириныКолонок.Добавить(12); // Приемник
	ШириныКолонок.Добавить(14); // Расхождения
	ШириныКолонок.Добавить(20); // Статус

	Для НомерКолонки = 1 По ШириныКолонок.Количество() Цикл
		ТабДок.Область(1, НомерКолонки, ТабДок.ВысотаТаблицы, НомерКолонки).ШиринаКолонки =
			ШириныКолонок[НомерКолонки - 1];
	КонецЦикла;

КонецПроцедуры

// Инициализирует кэш детализации ОСВ перед новой сверкой.
//
Процедура ИнициализироватьДетализациюОСВ()

	мДетализацияОСВ = Новый Соответствие;

КонецПроцедуры

// Возвращает ключ строки табличной части "ОбъектыСверки" для кэша детализации ОСВ.
//
Функция КлючСтрокиОбъектаСверки(СтрокаОбъекта)

	Возврат СтрокаОбъекта.ТипОбъекта + "#" + СтрокаОбъекта.ИмяOData;

КонецФункции

// Сохраняет детализацию сверки ОСВ по строке объекта в кэше модуля.
//
Процедура СохранитьДетализациюОСВ(СтрокаОбъекта, ДетализацияПоИсточникам)

	Если мДетализацияОСВ = Неопределено Тогда
		мДетализацияОСВ = Новый Соответствие;
	КонецЕсли;

	мДетализацияОСВ.Вставить(КлючСтрокиОбъектаСверки(СтрокаОбъекта), ДетализацияПоИсточникам);

КонецПроцедуры

// Возвращает сохраненную детализацию сверки ОСВ по строке объекта.
//
Функция ПолучитьДетализациюОСВ(СтрокаОбъекта)

	Если мДетализацияОСВ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат мДетализацияОСВ.Получить(КлючСтрокиОбъектаСверки(СтрокаОбъекта));

КонецФункции

// Выводит в табличный документ детализацию сверки ОСВ по источникам.
//
Процедура ВывестиДетализациюОСВВОтчет(ТабДок, Макет, СтрокаОбъекта)

	ДетализацияПоИсточникам = ПолучитьДетализациюОСВ(СтрокаОбъекта);
	Если ДетализацияПоИсточникам = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОбластьИсточник = Макет.ПолучитьОбласть("СтрокаИсточникОСВ");
	ОбластьШапкаОСВ = Макет.ПолучитьОбласть("ШапкаОСВ");
	ОбластьСтрокаОСВ = Макет.ПолучитьОбласть("СтрокаОСВ");
	ОбластьОшибки = Макет.ПолучитьОбласть("СтрокаОшибка");

	Для Каждого ДетализацияИсточника Из ДетализацияПоИсточникам Цикл

		ОбластьИсточник.Параметры.ПредставлениеИсточника = СтрШаблон(
			НСтр("ru = 'Источник: %1'"), ДетализацияИсточника.ПредставлениеИсточника);
		ТабДок.Вывести(ОбластьИсточник);

		Если ЗначениеЗаполнено(ДетализацияИсточника.ТекстОшибки) Тогда
			ОбластьОшибки.Параметры.ТекстОшибки = ДетализацияИсточника.ТекстОшибки;
			ТабДок.Вывести(ОбластьОшибки);
			Продолжить;
		КонецЕсли;

		ТабДок.Вывести(ОбластьШапкаОСВ);

		Для Каждого СтрокаСравнения Из ДетализацияИсточника.РезультатСравнения.СтрокиСравнения Цикл
			ОбластьСтрокаОСВ.Параметры.Показатель = СтрокаСравнения.Показатель;
			ОбластьСтрокаОСВ.Параметры.ЗначениеИсточник = ФорматСуммыОСВ(СтрокаСравнения.ЗначениеИсточник);
			ОбластьСтрокаОСВ.Параметры.ЗначениеПриемник = ФорматСуммыОСВ(СтрокаСравнения.ЗначениеПриемник);
			ОбластьСтрокаОСВ.Параметры.Расхождение = ФорматСуммыОСВ(СтрокаСравнения.Расхождение);
			ТабДок.Вывести(ОбластьСтрокаОСВ);
		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

// Возвращает код состояния HTTP, соответствующий успешному ответу сервера.
//
Функция КодСостоянияHTTPУспешно()

	Возврат 200;

КонецФункции

// Возвращает массив описаний метаданных документов-регистраторов указанного регистра
// бухгалтерии. У метаданных регистра нет отдельного свойства со списком регистраторов,
// поэтому используются допустимые типы стандартного реквизита "Регистратор": среди
// них перебором через "Метаданные.НайтиПоТипу()" отбираются только документы.
//
// Параметры:
// РегистрМетаданные - МетаданныеОбъекта - метаданные регистра бухгалтерии.
//
// Возвращаемое значение:
// Массив - элементы МетаданныеОбъекта документов-регистраторов.
//
Функция ПолучитьДокументыРегистраторыРегистра(РегистрМетаданные)

	Результат = Новый Массив;

	ТипРегистратора = РегистрМетаданные.СтандартныеРеквизиты.Регистратор.Тип;
	Для Каждого Тип Из ТипРегистратора.Типы() Цикл
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(Тип);
		Если МетаданныеОбъекта <> Неопределено И Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
			Результат.Добавить(МетаданныеОбъекта);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает массив описаний метаданных справочников, которые используются в качестве
// видов субконто указанного регистра бухгалтерии. Виды субконто определяются через
// план счетов, закрепленный за регистром, и связанный с этим планом счетов план видов
// характеристик "Виды субконто": допустимые типы значений характеристик перебираются,
// и из них отбираются только ссылки на справочники (перечисления и планы счетов
// в качестве субконто в список не включаются).
//
// Параметры:
// РегистрМетаданные - МетаданныеОбъекта - метаданные регистра бухгалтерии.
//
// Возвращаемое значение:
// Массив - элементы МетаданныеОбъекта справочников, являющихся видами субконто.
//
Функция ПолучитьСправочникиСубконтоРегистра(РегистрМетаданные)

	Результат = Новый Массив;

	ПланСчетовМетаданные = РегистрМетаданные.ПланСчетов;
	Если ПланСчетовМетаданные = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	ВидыСубконтоМетаданные = ПланСчетовМетаданные.ВидыСубконто;
	Если ВидыСубконтоМетаданные = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Для Каждого Тип Из ВидыСубконтоМетаданные.Тип.Типы() Цикл
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(Тип);
		Если МетаданныеОбъекта <> Неопределено И Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
			Если Результат.Найти(МетаданныеОбъекта) = Неопределено Тогда
				Результат.Добавить(МетаданныеОбъекта);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Проверяет доступность OData-сервиса одного источника.
//
// Параметры:
// СтрокаИсточника - СтрокаТаблицыЗначений - строка табличной части "ИсточникиСверки".
//
// Возвращаемое значение:
// Структура - результат проверки:
//   * Успешно - Булево - Истина, если подключение установлено;
//   * ТекстОшибки - Строка - описание причины неудачи.
//
Функция ПроверитьПодключениеКИсточнику(СтрокаИсточника)

	Результат = Новый Структура("Успешно, ТекстОшибки", Ложь, "");

	Если НЕ ЗначениеЗаполнено(СтрокаИсточника.URLСервераOData) Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Не заполнен URL сервера OData.'");
		Возврат Результат;
	КонецЕсли;

	Попытка
		ЧастиURL = РазложитьURL(СтрокаИсточника.URLСервераOData);
		Соединение = СоздатьHTTPСоединение(ЧастиURL, СтрокаИсточника.ИмяПользователяOData, СтрокаИсточника.ПарольOData);

		// Корень стандартного OData-интерфейса 1С обязательно требует завершающий
		// разделитель, иначе сервер отвечает переадресацией (код 301).
		HTTPЗапрос = Новый HTTPЗапрос(ЧастиURL.ПутьРесурса + "/");
		HTTPЗапрос.Заголовки.Вставить("Accept", "application/json");

		Ответ = Соединение.Получить(HTTPЗапрос);

		Если Ответ.КодСостояния = КодСостоянияHTTPУспешно() Тогда
			Результат.Успешно = Истина;
		Иначе
			Результат.ТекстОшибки = СтрШаблон(НСтр("ru = 'Сервер вернул код ответа %1.'"), Формат(Ответ.КодСостояния, "ЧГ=0"));
		КонецЕсли;
	Исключение
		Результат.ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Выполняет сверку итогов регистра бухгалтерии "Хозрасчетный" в формате ОСВ между
// каждым источником (через OData, виртуальная таблица BalanceAndTurnovers) и
// соответствующей организацией приемника (запрос к ОстаткиИОбороты). Сравниваются
// шесть показателей: сальдо на начало (Дт/Кт), обороты за период (Дт/Кт),
// сальдо на конец (Дт/Кт).
//
// Параметры:
// СтрокаОбъекта - СтрокаТаблицыЗначений - строка табличной части "ОбъектыСверки".
//
Процедура ВыполнитьСверкуРегистраХозрасчетный(СтрокаОбъекта)

	КоличествоПоказателей = 0;
	КоличествоСовпадений = 0;
	КоличествоРасхождений = 0;
	ТекстыОшибокИсточников = Новый Массив;
	ДетализацияПоИсточникам = Новый Массив;

	Для Каждого СтрокаИсточника Из ИсточникиСверки Цикл

		ПредставлениеИсточника = СтрокаИсточника.URLСервераOData;
		Если ЗначениеЗаполнено(СтрокаИсточника.Организация) Тогда
			ПредставлениеИсточника = ПредставлениеИсточника + " (" + Строка(СтрокаИсточника.Организация) + ")";
		КонецЕсли;

		Попытка
			ИтогиИсточника = ПолучитьИтогиОСВРегистраБухгалтерииOData(
				СтрокаОбъекта.ИмяOData, ДатаНачала, ДатаОкончания, СтрокаИсточника);
		Исключение
			ТекстыОшибокИсточников.Добавить(СтрШаблон("%1: %2", СтрокаИсточника.URLСервераOData, ОписаниеОшибки()));
			ДетализацияПоИсточникам.Добавить(Новый Структура(
				"ПредставлениеИсточника, ТекстОшибки, РезультатСравнения",
				ПредставлениеИсточника, ОписаниеОшибки(), Неопределено));
			Продолжить;
		КонецПопытки;

		ИтогиПриемника = ПолучитьИтогиОСВХозрасчетныйПриемник(СтрокаИсточника.Организация);
		РезультатСравнения = СравнитьИтогиОСВ(ИтогиИсточника, ИтогиПриемника);

		КоличествоПоказателей = КоличествоПоказателей + РезультатСравнения.КоличествоПоказателей;
		КоличествоСовпадений = КоличествоСовпадений + РезультатСравнения.КоличествоСовпадений;
		КоличествоРасхождений = КоличествоРасхождений + РезультатСравнения.КоличествоРасхождений;

		ДетализацияПоИсточникам.Добавить(Новый Структура(
			"ПредставлениеИсточника, ТекстОшибки, РезультатСравнения",
			ПредставлениеИсточника, "", РезультатСравнения));

	КонецЦикла;

	СтрокаОбъекта.КоличествоИсточник = КоличествоПоказателей;
	СтрокаОбъекта.КоличествоПриемник = КоличествоСовпадений;
	СтрокаОбъекта.КоличествоРасхождений = КоличествоРасхождений;

	СохранитьДетализациюОСВ(СтрокаОбъекта, ДетализацияПоИсточникам);

	Если ДетализацияПоИсточникам.Количество() > 0 Тогда
		СтрокаОбъекта.ТекстОшибки = ФорматироватьДетализациюОСВДляФормы(ДетализацияПоИсточникам);
	КонецЕсли;

	Если ТекстыОшибокИсточников.Количество() > 0 Тогда
		ТекстОшибок = СтрСоединить(ТекстыОшибокИсточников, Символы.ПС);
		Если ЗначениеЗаполнено(СтрокаОбъекта.ТекстОшибки) Тогда
			СтрокаОбъекта.ТекстОшибки = СтрокаОбъекта.ТекстОшибки + Символы.ПС + Символы.ПС + ТекстОшибок;
		Иначе
			СтрокаОбъекта.ТекстОшибки = ТекстОшибок;
		КонецЕсли;
	КонецЕсли;

	СтрокаОбъекта.СтатусСверки = ?(КоличествоРасхождений = 0 И ТекстыОшибокИсточников.Количество() = 0,
		НСтр("ru = 'Совпадает'"), НСтр("ru = 'Есть расхождения'"));

КонецПроцедуры

// Выполняет постатейную сверку ссылочного объекта (справочника или документа) по
// уникальным идентификаторам: получает объединенный набор Ref_Key со всех источников
// через OData и набор УникальныйИдентификатор() из приемника, сравнивает состав множеств.
// Совпадающие идентификаторы из разных источников (общие справочники) считаются один раз.
//
// Параметры:
// СтрокаОбъекта - СтрокаТаблицыЗначений - строка табличной части "ОбъектыСверки".
//
Процедура ВыполнитьСверкуСсылочногоОбъекта(СтрокаОбъекта)

	МножествоИсточник = Новый Соответствие;
	ТекстыОшибокИсточников = Новый Массив;

	Для Каждого СтрокаИсточника Из ИсточникиСверки Цикл
		Попытка
			МножествоТекущегоИсточника = ПолучитьUUIDОбъектовOData(СтрокаОбъекта.ИмяOData, СтрокаИсточника);
		Исключение
			ТекстыОшибокИсточников.Добавить(СтрШаблон("%1: %2", СтрокаИсточника.URLСервераOData, ОписаниеОшибки()));
			Продолжить;
		КонецПопытки;

		Для Каждого Элемент Из МножествоТекущегоИсточника Цикл
			МножествоИсточник.Вставить(Элемент.Ключ, Истина);
		КонецЦикла;
	КонецЦикла;

	МножествоПриемник = ПолучитьUUIDОбъектовПриемника(СтрокаОбъекта.ТипОбъекта, СтрокаОбъекта.ИмяOData);

	СтрокаОбъекта.КоличествоИсточник = МножествоИсточник.Количество();
	СтрокаОбъекта.КоличествоПриемник = МножествоПриемник.Количество();

	КоличествоРасхождений = 0;

	Для Каждого ЭлементИсточника Из МножествоИсточник Цикл
		Если МножествоПриемник.Получить(ЭлементИсточника.Ключ) = Неопределено Тогда
			КоличествоРасхождений = КоличествоРасхождений + 1;
		КонецЕсли;
	КонецЦикла;

	Для Каждого ЭлементПриемника Из МножествоПриемник Цикл
		Если МножествоИсточник.Получить(ЭлементПриемника.Ключ) = Неопределено Тогда
			КоличествоРасхождений = КоличествоРасхождений + 1;
		КонецЕсли;
	КонецЦикла;

	СтрокаОбъекта.КоличествоРасхождений = КоличествоРасхождений;

	Если ТекстыОшибокИсточников.Количество() > 0 Тогда
		СтрокаОбъекта.ТекстОшибки = СтрСоединить(ТекстыОшибокИсточников, Символы.ПС);
	КонецЕсли;

	СтрокаОбъекта.СтатусСверки = ?(КоличествоРасхождений = 0 И ТекстыОшибокИсточников.Количество() = 0,
		НСтр("ru = 'Совпадает'"), НСтр("ru = 'Есть расхождения'"));

КонецПроцедуры

// Возвращает итоги ОСВ регистра бухгалтерии "Хозрасчетный" в приемнике за период,
// указанный в реквизитах "ДатаНачала" и "ДатаОкончания", в разрезе организации,
// соответствующей проверяемому источнику.
//
// Параметры:
// Организация - СправочникСсылка - организация приемника, соответствующая источнику;
//               Неопределено, если строка источника не указывает организацию.
//
// Возвращаемое значение:
// Структура - итоги ОСВ (сальдо на начало, обороты, сальдо на конец по Дт и Кт).
//
Функция ПолучитьИтогиОСВХозрасчетныйПриемник(Организация = Неопределено)

	ТекстОтбораПоОрганизации = "";
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстОтбораПоОрганизации = "
		|	И ОстаткиИОбороты.Организация = &Организация";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ОстаткиИОбороты.СуммаНачальныйОстатокДт), 0) КАК СальдоНачалоДт,
	|	ЕСТЬNULL(СУММА(ОстаткиИОбороты.СуммаНачальныйОстатокКт), 0) КАК СальдоНачалоКт,
	|	ЕСТЬNULL(СУММА(ОстаткиИОбороты.СуммаОборотДт), 0) КАК ОборотДт,
	|	ЕСТЬNULL(СУММА(ОстаткиИОбороты.СуммаОборотКт), 0) КАК ОборотКт,
	|	ЕСТЬNULL(СУММА(ОстаткиИОбороты.СуммаКонечныйОстатокДт), 0) КАК СальдоКонецДт,
	|	ЕСТЬNULL(СУММА(ОстаткиИОбороты.СуммаКонечныйОстатокКт), 0) КАК СальдоКонецКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, , , ) КАК ОстаткиИОбороты
	|ГДЕ
	|	ИСТИНА"
	+ ТекстОтбораПоОрганизации;

	ДатаНачалаОтбора = ?(ЗначениеЗаполнено(ДатаНачала), ДатаНачала, Дата(1, 1, 1));
	ДатаОкончанияОтбора = ?(ЗначениеЗаполнено(ДатаОкончания), КонецДня(ДатаОкончания), Дата(9999, 12, 31));
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаОтбора);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияОтбора);
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();
	Итоги = НовыеИтогиОСВ();

	Если Выборка.Следующий() Тогда
		ЗаполнитьИтогиОСВИзВыборки(Итоги, Выборка);
	КонецЕсли;

	Возврат Итоги;

КонецФункции

// Возвращает соответствие уникальных идентификаторов ссылок приемника для справочника
// или документа, соответствующего указанной OData-коллекции.
//
// Параметры:
// ТипОбъекта - Строка - "Справочник" или "Документ";
// ИмяOData   - Строка - имя коллекции OData вида "Catalog_Имя" или "Document_Имя".
//
Функция ПолучитьUUIDОбъектовПриемника(ТипОбъекта, ИмяOData)

	Результат = Новый Соответствие;

	Если ТипОбъекта = "Справочник" Тогда
		ИмяМетаданных = Сред(ИмяOData, СтрДлина("Catalog_") + 1);
		ТекстЗапроса = "ВЫБРАТЬ
		|	Т.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник." + ИмяМетаданных + " КАК Т";
	ИначеЕсли ТипОбъекта = "Документ" Тогда
		ИмяМетаданных = Сред(ИмяOData, СтрДлина("Document_") + 1);
		ТекстЗапроса = "ВЫБРАТЬ
		|	Т.Ссылка КАК Ссылка
		|ИЗ
		|	Документ." + ИмяМетаданных + " КАК Т";
	Иначе
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		UUID = НРег(Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		Результат.Вставить(UUID, Истина);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает соответствие уникальных идентификаторов (Ref_Key) элементов коллекции
// OData одного источника, постранично обходя весь список через odata.nextLink.
//
// Параметры:
// ИмяКоллекции    - Строка - имя коллекции OData, например "Catalog_Номенклатура";
// СтрокаИсточника - СтрокаТаблицыЗначений - строка табличной части "ИсточникиСверки".
//
Функция ПолучитьUUIDОбъектовOData(ИмяКоллекции, СтрокаИсточника)

	Результат = Новый Соответствие;

	ЧастиURL = РазложитьURL(СтрокаИсточника.URLСервераOData);
	Соединение = СоздатьHTTPСоединение(ЧастиURL, СтрокаИсточника.ИмяПользователяOData, СтрокаИсточника.ПарольOData);

	РазмерСтраницы = 1000;
	ОтносительныйПуть = ЧастиURL.ПутьРесурса + "/" + ИмяКоллекции
		+ "?$select=Ref_Key&$format=json&$top=" + Формат(РазмерСтраницы, "ЧГ=0");

	Пока ЗначениеЗаполнено(ОтносительныйПуть) Цикл

		HTTPЗапрос = Новый HTTPЗапрос(ОтносительныйПуть);
		HTTPЗапрос.Заголовки.Вставить("Accept", "application/json");

		Ответ = Соединение.Получить(HTTPЗапрос);

		Если Ответ.КодСостояния <> КодСостоянияHTTPУспешно() Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка запроса к коллекции %1: код ответа %2.'"),
				ИмяКоллекции, Формат(Ответ.КодСостояния, "ЧГ=0"));
		КонецЕсли;

		ТелоОтвета = РазобратьJSON(Ответ.ПолучитьТелоКакСтроку());
		СписокЭлементов = ТелоОтвета.Получить("value");

		Если СписокЭлементов <> Неопределено Тогда
			Для Каждого Элемент Из СписокЭлементов Цикл
				UUID = НРег(Элемент.Получить("Ref_Key"));
				Результат.Вставить(UUID, Истина);
			КонецЦикла;
		КонецЕсли;

		СледующаяСсылка = ТелоОтвета.Получить("odata.nextLink");
		Если ЗначениеЗаполнено(СледующаяСсылка) Тогда
			ОтносительныйПуть = ПолучитьОтносительныйПутьИзСсылки(СледующаяСсылка);
		Иначе
			ОтносительныйПуть = "";
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Проверяет доступность указанной коллекции в стандартном интерфейсе OData одного
// источника. Выполняет минимальный запрос ($top=0), не считывая записи коллекции.
//
// Параметры:
// ИмяКоллекции    - Строка - имя коллекции OData, например "AccountingRegister_Хозрасчетный";
// СтрокаИсточника - СтрокаТаблицыЗначений - строка табличной части "ИсточникиСверки".
//
// Возвращаемое значение:
// Структура - результат проверки:
//   * Существует - Булево - Истина, если коллекция доступна;
//   * ТекстОшибки - Строка - описание причины неудачи.
//
Функция ПроверитьНаличиеКоллекцииOData(ИмяКоллекции, СтрокаИсточника)

	Результат = Новый Структура("Существует, ТекстОшибки", Ложь, "");

	Если НЕ ЗначениеЗаполнено(СтрокаИсточника.URLСервераOData) Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Не заполнен URL сервера OData.'");
		Возврат Результат;
	КонецЕсли;

	Попытка
		ЧастиURL = РазложитьURL(СтрокаИсточника.URLСервераOData);
		Соединение = СоздатьHTTPСоединение(ЧастиURL, СтрокаИсточника.ИмяПользователяOData, СтрокаИсточника.ПарольOData);

		ОтносительныйПуть = ЧастиURL.ПутьРесурса + "/" + ИмяКоллекции + "?$top=0&$format=json";
		HTTPЗапрос = Новый HTTPЗапрос(ОтносительныйПуть);
		HTTPЗапрос.Заголовки.Вставить("Accept", "application/json");

		Ответ = Соединение.Получить(HTTPЗапрос);

		Если Ответ.КодСостояния = КодСостоянияHTTPУспешно() Тогда
			Результат.Существует = Истина;
		ИначеЕсли Ответ.КодСостояния = 404 Тогда
			Результат.ТекстОшибки = СтрШаблон(НСтр("ru = 'Коллекция %1 не найдена в стандартном интерфейсе OData
				|источника (код ответа 404). Проверьте, что объект включен в состав стандартного
				|интерфейса OData на источнике.'"), ИмяКоллекции);
		Иначе
			Результат.ТекстОшибки = СтрШаблон(НСтр("ru = 'Сервер вернул код ответа %1 при обращении к коллекции %2.'"),
				Формат(Ответ.КодСостояния, "ЧГ=0"), ИмяКоллекции);
		КонецЕсли;
	Исключение
		Результат.ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Возвращает итоги ОСВ регистра бухгалтерии одного источника за период.
//
// Используется виртуальная таблица OData "BalanceAndTurnovers" (аналог
// "ОстаткиИОбороты"). Данные постранично считываются и агрегируются по шести
// показателям ОСВ. При заполненной организации в строке источника применяется
// отбор Condition по полю "Организация_Key" (GUID организации приемника
// предполагается синхронизированным с источником).
//
// Параметры:
// ИмяКоллекции    - Строка - имя коллекции OData регистра бухгалтерии;
// ДатаНачала      - Дата - начало периода отбора (необязательно);
// ДатаОкончания   - Дата - окончание периода отбора (необязательно);
// СтрокаИсточника - СтрокаТаблицыЗначений - строка табличной части "ИсточникиСверки".
//
// Возвращаемое значение:
// Структура - итоги ОСВ (сальдо на начало, обороты, сальдо на конец по Дт и Кт).
//
Функция ПолучитьИтогиОСВРегистраБухгалтерииOData(ИмяКоллекции, ДатаНачала, ДатаОкончания, СтрокаИсточника)

	ЧастиURL = РазложитьURL(СтрокаИсточника.URLСервераOData);
	Соединение = СоздатьHTTPСоединение(ЧастиURL, СтрокаИсточника.ИмяПользователяOData, СтрокаИсточника.ПарольOData);

	ПараметрыФункции = СформироватьПараметрыПериодаOData(ДатаНачала, ДатаОкончания);
	ДобавитьУсловиеОрганизацииOData(ПараметрыФункции, СтрокаИсточника.Организация);

	Итоги = НовыеИтогиОСВ();
	РазмерСтраницы = 1000;
	ОтносительныйПуть = ЧастиURL.ПутьРесурса + "/" + ИмяКоллекции
		+ "/BalanceAndTurnovers(" + СтрСоединить(ПараметрыФункции, ",") + ")"
		+ "?$format=json&$top=" + Формат(РазмерСтраницы, "ЧГ=0");

	Пока ЗначениеЗаполнено(ОтносительныйПуть) Цикл

		HTTPЗапрос = Новый HTTPЗапрос(ОтносительныйПуть);
		HTTPЗапрос.Заголовки.Вставить("Accept", "application/json");

		Ответ = Соединение.Получить(HTTPЗапрос);

		Если Ответ.КодСостояния <> КодСостоянияHTTPУспешно() Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Ошибка получения итогов ОСВ регистра %1: код ответа %2.'"),
				ИмяКоллекции, Формат(Ответ.КодСостояния, "ЧГ=0"));
		КонецЕсли;

		ТелоОтвета = РазобратьJSON(Ответ.ПолучитьТелоКакСтроку());
		СписокЭлементов = ТелоОтвета.Получить("value");

		Если СписокЭлементов <> Неопределено Тогда
			Для Каждого Элемент Из СписокЭлементов Цикл
				ДобавитьИтогиОСВИзOData(Итоги, Элемент);
			КонецЦикла;
		КонецЕсли;

		СледующаяСсылка = ТелоОтвета.Получить("odata.nextLink");
		Если ЗначениеЗаполнено(СледующаяСсылка) Тогда
			ОтносительныйПуть = ПолучитьОтносительныйПутьИзСсылки(СледующаяСсылка);
		Иначе
			ОтносительныйПуть = "";
		КонецЕсли;

	КонецЦикла;

	Возврат Итоги;

КонецФункции

// Создает пустую структуру итогов ОСВ.
//
Функция НовыеИтогиОСВ()

	Итоги = Новый Структура;
	Итоги.Вставить("СальдоНачалоДт", 0);
	Итоги.Вставить("СальдоНачалоКт", 0);
	Итоги.Вставить("ОборотДт", 0);
	Итоги.Вставить("ОборотКт", 0);
	Итоги.Вставить("СальдоКонецДт", 0);
	Итоги.Вставить("СальдоКонецКт", 0);

	Возврат Итоги;

КонецФункции

// Заполняет структуру итогов ОСВ значениями из выборки запроса.
//
Процедура ЗаполнитьИтогиОСВИзВыборки(Итоги, Выборка)

	Итоги.СальдоНачалоДт = Выборка.СальдоНачалоДт;
	Итоги.СальдоНачалоКт = Выборка.СальдоНачалоКт;
	Итоги.ОборотДт = Выборка.ОборотДт;
	Итоги.ОборотКт = Выборка.ОборотКт;
	Итоги.СальдоКонецДт = Выборка.СальдоКонецДт;
	Итоги.СальдоКонецКт = Выборка.СальдоКонецКт;

КонецПроцедуры

// Добавляет к накопленным итогам ОСВ значения одной строки ответа OData.
//
Процедура ДобавитьИтогиОСВИзOData(Итоги, ЭлементOData)

	Итоги.СальдоНачалоДт = Итоги.СальдоНачалоДт + ПолучитьЧислоПоляOData(ЭлементOData, ИменаПолейСальдоНачалоДтOData());
	Итоги.СальдоНачалоКт = Итоги.СальдоНачалоКт + ПолучитьЧислоПоляOData(ЭлементOData, ИменаПолейСальдоНачалоКтOData());
	Итоги.ОборотДт = Итоги.ОборотДт + ПолучитьЧислоПоляOData(ЭлементOData, ИменаПолейОборотДтOData());
	Итоги.ОборотКт = Итоги.ОборотКт + ПолучитьЧислоПоляOData(ЭлементOData, ИменаПолейОборотКтOData());
	Итоги.СальдоКонецДт = Итоги.СальдоКонецДт + ПолучитьЧислоПоляOData(ЭлементOData, ИменаПолейСальдоКонецДтOData());
	Итоги.СальдоКонецКт = Итоги.СальдоКонецКт + ПолучитьЧислоПоляOData(ЭлементOData, ИменаПолейСальдоКонецКтOData());

КонецПроцедуры

// Сравнивает итоги ОСВ источника и приемника по шести показателям.
//
// Возвращаемое значение:
// Структура:
//   * КоличествоПоказателей - Число;
//   * КоличествоСовпадений - Число;
//   * КоличествоРасхождений - Число;
//   * СтрокиСравнения - Массив из Структура.
//
Функция СравнитьИтогиОСВ(ИтогиИсточника, ИтогиПриемника)

	ОписанияПоказателей = ОписанияПоказателейОСВ();
	СтрокиСравнения = Новый Массив;
	КоличествоСовпадений = 0;
	КоличествоРасхождений = 0;

	Для Каждого ОписаниеПоказателя Из ОписанияПоказателей Цикл

		ЗначениеИсточника = ИтогиИсточника[ОписаниеПоказателя.ИмяПоля];
		ЗначениеПриемника = ИтогиПриемника[ОписаниеПоказателя.ИмяПоля];
		Расхождение = ЗначениеИсточника - ЗначениеПриемника;
		Совпадает = (Окр(Расхождение, 2) = 0);

		Если Совпадает Тогда
			КоличествоСовпадений = КоличествоСовпадений + 1;
		Иначе
			КоличествоРасхождений = КоличествоРасхождений + 1;
		КонецЕсли;

		СтрокаСравнения = Новый Структура;
		СтрокаСравнения.Вставить("Показатель", ОписаниеПоказателя.Представление);
		СтрокаСравнения.Вставить("ЗначениеИсточник", ЗначениеИсточника);
		СтрокаСравнения.Вставить("ЗначениеПриемник", ЗначениеПриемника);
		СтрокаСравнения.Вставить("Расхождение", Расхождение);
		СтрокаСравнения.Вставить("Совпадает", Совпадает);
		СтрокиСравнения.Добавить(СтрокаСравнения);

	КонецЦикла;

	Результат = Новый Структура;
	Результат.Вставить("КоличествоПоказателей", ОписанияПоказателей.Количество());
	Результат.Вставить("КоличествоСовпадений", КоличествоСовпадений);
	Результат.Вставить("КоличествоРасхождений", КоличествоРасхождений);
	Результат.Вставить("СтрокиСравнения", СтрокиСравнения);

	Возврат Результат;

КонецФункции

// Формирует текстовое представление детализации ОСВ для колонки формы.
//
Функция ФорматироватьДетализациюОСВДляФормы(ДетализацияПоИсточникам)

	БлокиТекста = Новый Массив;

	Для Каждого ДетализацияИсточника Из ДетализацияПоИсточникам Цикл

		БлокиТекста.Добавить(СтрШаблон(НСтр("ru = 'Источник: %1'"), ДетализацияИсточника.ПредставлениеИсточника));

		Если ЗначениеЗаполнено(ДетализацияИсточника.ТекстОшибки) Тогда
			БлокиТекста.Добавить(ДетализацияИсточника.ТекстОшибки);
			Продолжить;
		КонецЕсли;

		Для Каждого СтрокаСравнения Из ДетализацияИсточника.РезультатСравнения.СтрокиСравнения Цикл
			БлокиТекста.Добавить(СтрШаблон(
				НСтр("ru = '%1: источник %2, приемник %3, расхождение %4'"),
				СтрокаСравнения.Показатель,
				ФорматСуммыОСВ(СтрокаСравнения.ЗначениеИсточник),
				ФорматСуммыОСВ(СтрокаСравнения.ЗначениеПриемник),
				ФорматСуммыОСВ(СтрокаСравнения.Расхождение)));
		КонецЦикла;

	КонецЦикла;

	Возврат СтрСоединить(БлокиТекста, Символы.ПС);

КонецФункции

// Форматирует сумму показателя ОСВ для вывода в отчет и форму.
//
Функция ФорматСуммыОСВ(Значение)

	Возврат Формат(Значение, "ЧДЦ=2; ЧРД=.; ЧГ=3,0");

КонецФункции

// Возвращает массив описаний показателей ОСВ для сравнения.
//
Функция ОписанияПоказателейОСВ()

	Результат = Новый Массив;
	ДобавитьОписаниеПоказателяОСВ(Результат, "СальдоНачалоДт", НСтр("ru = 'Сальдо на начало периода (Дт)'"));
	ДобавитьОписаниеПоказателяОСВ(Результат, "СальдоНачалоКт", НСтр("ru = 'Сальдо на начало периода (Кт)'"));
	ДобавитьОписаниеПоказателяОСВ(Результат, "ОборотДт", НСтр("ru = 'Обороты за период (Дт)'"));
	ДобавитьОписаниеПоказателяОСВ(Результат, "ОборотКт", НСтр("ru = 'Обороты за период (Кт)'"));
	ДобавитьОписаниеПоказателяОСВ(Результат, "СальдоКонецДт", НСтр("ru = 'Сальдо на конец периода (Дт)'"));
	ДобавитьОписаниеПоказателяОСВ(Результат, "СальдоКонецКт", НСтр("ru = 'Сальдо на конец периода (Кт)'"));

	Возврат Результат;

КонецФункции

// Добавляет описание одного показателя ОСВ в массив.
//
Процедура ДобавитьОписаниеПоказателяОСВ(МассивОписаний, ИмяПоля, Представление)

	Описание = Новый Структура("ИмяПоля, Представление", ИмяПоля, Представление);
	МассивОписаний.Добавить(Описание);

КонецПроцедуры

// Формирует параметры StartPeriod/EndPeriod для виртуальных таблиц OData.
//
Функция СформироватьПараметрыПериодаOData(ДатаНачала, ДатаОкончания)

	ПараметрыФункции = Новый Массив;

	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		ПараметрыФункции.Добавить(СтрШаблон("StartPeriod=datetime'%1'",
			Формат(ДатаНачала, "ДФ=yyyy-MM-ddT00:00:00")));
	КонецЕсли;

	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		ПараметрыФункции.Добавить(СтрШаблон("EndPeriod=datetime'%1'",
			Формат(КонецДня(ДатаОкончания), "ДФ=yyyy-MM-ddT23:59:59")));
	КонецЕсли;

	Возврат ПараметрыФункции;

КонецФункции

// Добавляет в параметры OData отбор по организации источника.
//
Процедура ДобавитьУсловиеОрганизацииOData(ПараметрыФункции, Организация)

	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;

	// Формат OData: Condition='Организация_Key eq guid'uuid''
	// В строковом литерале 1С одинарная кавычка пишется один раз.
	GUIDОрганизации = НормализоватьGUIDOData(Организация.УникальныйИдентификатор());
	ПараметрыФункции.Добавить(СтрШаблон(
		"Condition='Организация_Key eq guid'%1''",
		GUIDОрганизации));

КонецПроцедуры

// Возвращает числовое значение поля OData, перебирая допустимые имена свойства.
//
Функция ПолучитьЧислоПоляOData(ЭлементOData, ИменаПолей)

	Для Каждого ИмяПоля Из ИменаПолей Цикл
		ЗначениеПоля = ЭлементOData.Получить(ИмяПоля);
		Если ЗначениеПоля <> Неопределено Тогда
			Возврат Число(ЗначениеПоля);
		КонецЕсли;
	КонецЦикла;

	Возврат 0;

КонецФункции

Функция ИменаПолейСальдоНачалоДтOData()

	Имена = Новый Массив;
	// Типовой ответ стандартного интерфейса OData БП: русское имя ресурса + англ. суффикс.
	Имена.Добавить("СуммаOpeningBalanceDr");
	Имена.Добавить("СуммаНачальныйОстатокДт");
	Имена.Добавить("AmountOpeningBalanceDr");
	Имена.Добавить("SumOpeningBalanceDr");
	Имена.Добавить("SumOpeningSplittedBalanceDr");
	Возврат Имена;

КонецФункции

Функция ИменаПолейСальдоНачалоКтOData()

	Имена = Новый Массив;
	Имена.Добавить("СуммаOpeningBalanceCr");
	Имена.Добавить("СуммаНачальныйОстатокКт");
	Имена.Добавить("AmountOpeningBalanceCr");
	Имена.Добавить("SumOpeningBalanceCr");
	Имена.Добавить("SumOpeningSplittedBalanceCr");
	Возврат Имена;

КонецФункции

Функция ИменаПолейОборотДтOData()

	Имена = Новый Массив;
	Имена.Добавить("СуммаTurnoverDr");
	Имена.Добавить("СуммаОборотДт");
	Имена.Добавить("AmountTurnoverDr");
	Имена.Добавить("SumTurnoverDr");
	Возврат Имена;

КонецФункции

Функция ИменаПолейОборотКтOData()

	Имена = Новый Массив;
	Имена.Добавить("СуммаTurnoverCr");
	Имена.Добавить("СуммаОборотКт");
	Имена.Добавить("AmountTurnoverCr");
	Имена.Добавить("SumTurnoverCr");
	Возврат Имена;

КонецФункции

Функция ИменаПолейСальдоКонецДтOData()

	Имена = Новый Массив;
	Имена.Добавить("СуммаClosingBalanceDr");
	Имена.Добавить("СуммаКонечныйОстатокДт");
	Имена.Добавить("AmountClosingBalanceDr");
	Имена.Добавить("SumClosingBalanceDr");
	Имена.Добавить("SumClosingSplittedBalanceDr");
	Возврат Имена;

КонецФункции

Функция ИменаПолейСальдоКонецКтOData()

	Имена = Новый Массив;
	Имена.Добавить("СуммаClosingBalanceCr");
	Имена.Добавить("СуммаКонечныйОстатокКт");
	Имена.Добавить("AmountClosingBalanceCr");
	Имена.Добавить("SumClosingBalanceCr");
	Имена.Добавить("SumClosingSplittedBalanceCr");
	Возврат Имена;

КонецФункции

// Разбирает текст JSON в дерево значений Соответствие/Массив/примитивы.
// Объекты JSON читаются как Соответствие (а не Структура), чтобы корректно обрабатывать
// ключи с точками, например "odata.nextLink".
//
// Параметры:
// ТекстJSON - Строка - текст ответа сервера в формате JSON.
//
Функция РазобратьJSON(ТекстJSON)

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
	ЧтениеJSON.Закрыть();

	Возврат Результат;

КонецФункции

// Создает HTTP-соединение с сервером OData по параметрам конкретного источника.
//
// Параметры:
// ЧастиURL       - Структура - результат РазложитьURL(...);
// ИмяПользователя - Строка - имя пользователя OData источника;
// Пароль          - Строка - пароль пользователя OData источника.
//
Функция СоздатьHTTPСоединение(ЧастиURL, ИмяПользователя, Пароль)

	Таймаут = ?(ТаймаутЗапроса > 0, ТаймаутЗапроса, 30);

	Если ЧастиURL.Схема = "https" Тогда
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
		Возврат Новый HTTPСоединение(ЧастиURL.Сервер, ЧастиURL.Порт,
			ИмяПользователя, Пароль, , Таймаут, ЗащищенноеСоединение);
	Иначе
		Возврат Новый HTTPСоединение(ЧастиURL.Сервер, ЧастиURL.Порт,
			ИмяПользователя, Пароль, , Таймаут);
	КонецЕсли;

КонецФункции

// Разбирает URL сервиса OData на составные части.
//
// Параметры:
// URL - Строка - полный URL OData-сервиса, например "http://server/base/odata/standard.odata".
//
// Возвращаемое значение:
// Структура - Схема, Сервер, Порт, ПутьРесурса.
//
Функция РазложитьURL(URL)

	Результат = Новый Структура("Схема, Сервер, Порт, ПутьРесурса");

	ПозицияСхемы = СтрНайти(URL, "://");
	Если ПозицияСхемы = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Некорректный URL сервера OData. Ожидается http:// или https://'");
	КонецЕсли;

	Результат.Схема = НРег(Лев(URL, ПозицияСхемы - 1));
	Остаток = Сред(URL, ПозицияСхемы + 3);

	ПозицияПути = СтрНайти(Остаток, "/");
	Если ПозицияПути = 0 Тогда
		ХостПорт = Остаток;
		Результат.ПутьРесурса = "";
	Иначе
		ХостПорт = Лев(Остаток, ПозицияПути - 1);
		ПутьРесурса = Сред(Остаток, ПозицияПути);
		Если Прав(ПутьРесурса, 1) = "/" Тогда
			ПутьРесурса = Лев(ПутьРесурса, СтрДлина(ПутьРесурса) - 1);
		КонецЕсли;
		Результат.ПутьРесурса = ПутьРесурса;
	КонецЕсли;

	ПозицияПорта = СтрНайти(ХостПорт, ":");
	Если ПозицияПорта > 0 Тогда
		Результат.Сервер = Лев(ХостПорт, ПозицияПорта - 1);
		Результат.Порт = Число(Сред(ХостПорт, ПозицияПорта + 1));
	Иначе
		Результат.Сервер = ХостПорт;
		Результат.Порт = ?(Результат.Схема = "https", 443, 80);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Преобразует абсолютную ссылку из "odata.nextLink" в относительный путь запроса.
//
// Параметры:
// АбсолютнаяСсылка - Строка - абсолютный URL, полученный в свойстве "odata.nextLink".
//
Функция ПолучитьОтносительныйПутьИзСсылки(АбсолютнаяСсылка)

	ПозицияСхемы = СтрНайти(АбсолютнаяСсылка, "://");
	Если ПозицияСхемы = 0 Тогда
		Возврат АбсолютнаяСсылка;
	КонецЕсли;

	Остаток = Сред(АбсолютнаяСсылка, ПозицияСхемы + 3);
	ПозицияПути = СтрНайти(Остаток, "/");

	Если ПозицияПути = 0 Тогда
		Возврат "";
	КонецЕсли;

	Возврат Сред(Остаток, ПозицияПути);

КонецФункции

#КонецОбласти
